espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_PWR_LPCPU_CFG_REG register
 *  config register for lpcpu power control
 */
#define LP_PWR_LPCPU_CFG_REG (DR_REG_LP_PWR_BASE + 0x0)
/** LP_PWR_LPCPU_STALL_WAIT_TIMER : R/W; bitpos: [7:0]; default: 0;
 *  stall wait timer for lpcpu during lpcpu power off sequence
 */
#define LP_PWR_LPCPU_STALL_WAIT_TIMER    0x000000FFU
#define LP_PWR_LPCPU_STALL_WAIT_TIMER_M  (LP_PWR_LPCPU_STALL_WAIT_TIMER_V << LP_PWR_LPCPU_STALL_WAIT_TIMER_S)
#define LP_PWR_LPCPU_STALL_WAIT_TIMER_V  0x000000FFU
#define LP_PWR_LPCPU_STALL_WAIT_TIMER_S  0
/** LP_PWR_LPCPU_STALL_FLAG_EN : R/W; bitpos: [8]; default: 1;
 *  1: wait for stall rdy input during lpcpu power off sequence
 *  0:do not wait for stall rdy during lpcpu power off sequence
 */
#define LP_PWR_LPCPU_STALL_FLAG_EN    (BIT(8))
#define LP_PWR_LPCPU_STALL_FLAG_EN_M  (LP_PWR_LPCPU_STALL_FLAG_EN_V << LP_PWR_LPCPU_STALL_FLAG_EN_S)
#define LP_PWR_LPCPU_STALL_FLAG_EN_V  0x00000001U
#define LP_PWR_LPCPU_STALL_FLAG_EN_S  8
/** LP_PWR_LPCPU_STALL_EN : R/W; bitpos: [9]; default: 1;
 *  1: enable lpcpu stall during lpcpu power off sequence
 *  0: disable lpcpu stall during lpcpu power off sequence
 */
#define LP_PWR_LPCPU_STALL_EN    (BIT(9))
#define LP_PWR_LPCPU_STALL_EN_M  (LP_PWR_LPCPU_STALL_EN_V << LP_PWR_LPCPU_STALL_EN_S)
#define LP_PWR_LPCPU_STALL_EN_V  0x00000001U
#define LP_PWR_LPCPU_STALL_EN_S  9
/** LP_PWR_LPCPU_RESET_EN : R/W; bitpos: [10]; default: 1;
 *  1: enable lpcpu reset during lpcpu power off sequence
 *  0: disable lpcpu reset during lpcpu power off sequence
 */
#define LP_PWR_LPCPU_RESET_EN    (BIT(10))
#define LP_PWR_LPCPU_RESET_EN_M  (LP_PWR_LPCPU_RESET_EN_V << LP_PWR_LPCPU_RESET_EN_S)
#define LP_PWR_LPCPU_RESET_EN_V  0x00000001U
#define LP_PWR_LPCPU_RESET_EN_S  10
/** LP_PWR_LPCPU_SLP_WAITI_FLAG_EN : R/W; bitpos: [11]; default: 0;
 *  1: validates lp cpu waiti rdy signal during lpcpu power off sequence
 *  0: invalidates lp cpu waiti rdy signal during lpcpu power off sequence
 */
#define LP_PWR_LPCPU_SLP_WAITI_FLAG_EN    (BIT(11))
#define LP_PWR_LPCPU_SLP_WAITI_FLAG_EN_M  (LP_PWR_LPCPU_SLP_WAITI_FLAG_EN_V << LP_PWR_LPCPU_SLP_WAITI_FLAG_EN_S)
#define LP_PWR_LPCPU_SLP_WAITI_FLAG_EN_V  0x00000001U
#define LP_PWR_LPCPU_SLP_WAITI_FLAG_EN_S  11
/** LP_PWR_LPCPU_SLP_BYPASS_INTR_EN : R/W; bitpos: [12]; default: 0;
 *  1: enable interrupt bypass signal for lpcpu during lpcpu power off sequence
 *  0: disable interrupt bypass signal for lpcpu during lpcpu power off sequence
 */
#define LP_PWR_LPCPU_SLP_BYPASS_INTR_EN    (BIT(12))
#define LP_PWR_LPCPU_SLP_BYPASS_INTR_EN_M  (LP_PWR_LPCPU_SLP_BYPASS_INTR_EN_V << LP_PWR_LPCPU_SLP_BYPASS_INTR_EN_S)
#define LP_PWR_LPCPU_SLP_BYPASS_INTR_EN_V  0x00000001U
#define LP_PWR_LPCPU_SLP_BYPASS_INTR_EN_S  12

/** LP_PWR_LPCPU_STS_REG register
 *  status register for LPCPU PWR
 */
#define LP_PWR_LPCPU_STS_REG (DR_REG_LP_PWR_BASE + 0x4)
/** LP_PWR_LPCPU_CUR_ST : RO; bitpos: [3:0]; default: 4;
 *  current power state register for lpcpu
 */
#define LP_PWR_LPCPU_CUR_ST    0x0000000FU
#define LP_PWR_LPCPU_CUR_ST_M  (LP_PWR_LPCPU_CUR_ST_V << LP_PWR_LPCPU_CUR_ST_S)
#define LP_PWR_LPCPU_CUR_ST_V  0x0000000FU
#define LP_PWR_LPCPU_CUR_ST_S  0
/** LP_PWR_LPCPU_IN_POWER_ON : RO; bitpos: [4]; default: 0;
 *  1:lpcpu current in power on mode
 *  0:lpcpu not in power on mode
 */
#define LP_PWR_LPCPU_IN_POWER_ON    (BIT(4))
#define LP_PWR_LPCPU_IN_POWER_ON_M  (LP_PWR_LPCPU_IN_POWER_ON_V << LP_PWR_LPCPU_IN_POWER_ON_S)
#define LP_PWR_LPCPU_IN_POWER_ON_V  0x00000001U
#define LP_PWR_LPCPU_IN_POWER_ON_S  4
/** LP_PWR_LPCPU_STALL_RDY : RO; bitpos: [5]; default: 0;
 *  1:lpcpu stall not ready
 *  0:lpcpu stall ready
 */
#define LP_PWR_LPCPU_STALL_RDY    (BIT(5))
#define LP_PWR_LPCPU_STALL_RDY_M  (LP_PWR_LPCPU_STALL_RDY_V << LP_PWR_LPCPU_STALL_RDY_S)
#define LP_PWR_LPCPU_STALL_RDY_V  0x00000001U
#define LP_PWR_LPCPU_STALL_RDY_S  5
/** LP_PWR_LPCPU_WAITI_RDY : RO; bitpos: [6]; default: 0;
 *  1:lpcpu stall waiti ready
 *  0:lpcpu stall waiti ready
 */
#define LP_PWR_LPCPU_WAITI_RDY    (BIT(6))
#define LP_PWR_LPCPU_WAITI_RDY_M  (LP_PWR_LPCPU_WAITI_RDY_V << LP_PWR_LPCPU_WAITI_RDY_S)
#define LP_PWR_LPCPU_WAITI_RDY_V  0x00000001U
#define LP_PWR_LPCPU_WAITI_RDY_S  6

/** LP_PWR_LPCPU_CTRL_REG register
 *  ctrl register for lpcpu power control
 */
#define LP_PWR_LPCPU_CTRL_REG (DR_REG_LP_PWR_BASE + 0x8)
/** LP_PWR_LPCPU_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for lpcpu
 */
#define LP_PWR_LPCPU_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_LPCPU_SW_SLEEP_REQ_M  (LP_PWR_LPCPU_SW_SLEEP_REQ_V << LP_PWR_LPCPU_SW_SLEEP_REQ_S)
#define LP_PWR_LPCPU_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_LPCPU_SW_SLEEP_REQ_S  0
/** LP_PWR_LPCPU_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for lpcpu
 */
#define LP_PWR_LPCPU_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_LPCPU_SW_WAKEUP_REQ_M  (LP_PWR_LPCPU_SW_WAKEUP_REQ_V << LP_PWR_LPCPU_SW_WAKEUP_REQ_S)
#define LP_PWR_LPCPU_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_LPCPU_SW_WAKEUP_REQ_S  1
/** LP_PWR_LPCPU_FORCE_STALL : R/W; bitpos: [2]; default: 0;
 *  1: force stall lpcpu
 *  0: no change
 */
#define LP_PWR_LPCPU_FORCE_STALL    (BIT(2))
#define LP_PWR_LPCPU_FORCE_STALL_M  (LP_PWR_LPCPU_FORCE_STALL_V << LP_PWR_LPCPU_FORCE_STALL_S)
#define LP_PWR_LPCPU_FORCE_STALL_V  0x00000001U
#define LP_PWR_LPCPU_FORCE_STALL_S  2
/** LP_PWR_LPCPU_FORCE_RESET : R/W; bitpos: [3]; default: 0;
 *  1: force reset lpcpu
 *  0: no change
 */
#define LP_PWR_LPCPU_FORCE_RESET    (BIT(3))
#define LP_PWR_LPCPU_FORCE_RESET_M  (LP_PWR_LPCPU_FORCE_RESET_V << LP_PWR_LPCPU_FORCE_RESET_S)
#define LP_PWR_LPCPU_FORCE_RESET_V  0x00000001U
#define LP_PWR_LPCPU_FORCE_RESET_S  3
/** LP_PWR_LPCPU_FORCE_NO_RESET : R/W; bitpos: [4]; default: 0;
 *  1: force no reset lpcpu
 *  0: no change
 */
#define LP_PWR_LPCPU_FORCE_NO_RESET    (BIT(4))
#define LP_PWR_LPCPU_FORCE_NO_RESET_M  (LP_PWR_LPCPU_FORCE_NO_RESET_V << LP_PWR_LPCPU_FORCE_NO_RESET_S)
#define LP_PWR_LPCPU_FORCE_NO_RESET_V  0x00000001U
#define LP_PWR_LPCPU_FORCE_NO_RESET_S  4

