espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_reg.h
/** LP_PWR_LPCPU_WAKEUP_SRC_REG register
 *  wakeup source register for lpcpu
 */
#define LP_PWR_LPCPU_WAKEUP_SRC_REG (DR_REG_LP_PWR_BASE + 0xc)
/** LP_PWR_LPCPU_WAKEUP_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  wakeup source enable signal for lpcpu
 */
#define LP_PWR_LPCPU_WAKEUP_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_LPCPU_WAKEUP_SOURCE_EN_M  (LP_PWR_LPCPU_WAKEUP_SOURCE_EN_V << LP_PWR_LPCPU_WAKEUP_SOURCE_EN_S)
#define LP_PWR_LPCPU_WAKEUP_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_LPCPU_WAKEUP_SOURCE_EN_S  0

/** LP_PWR_LPCPU_REJECT_SRC_REG register
 *  reject source register for lpcpu
 */
#define LP_PWR_LPCPU_REJECT_SRC_REG (DR_REG_LP_PWR_BASE + 0x10)
/** LP_PWR_LPCPU_REJECT_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  reject source enable signal for lpcpu
 */
#define LP_PWR_LPCPU_REJECT_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_LPCPU_REJECT_SOURCE_EN_M  (LP_PWR_LPCPU_REJECT_SOURCE_EN_V << LP_PWR_LPCPU_REJECT_SOURCE_EN_S)
#define LP_PWR_LPCPU_REJECT_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_LPCPU_REJECT_SOURCE_EN_S  0
/** LP_PWR_LPCPU_SLEEP_REJECT_EN : R/W; bitpos: [31]; default: 0;
 *  1: sleep request can be rejected
 *  0: sleep request cannot be rejected
 */
#define LP_PWR_LPCPU_SLEEP_REJECT_EN    (BIT(31))
#define LP_PWR_LPCPU_SLEEP_REJECT_EN_M  (LP_PWR_LPCPU_SLEEP_REJECT_EN_V << LP_PWR_LPCPU_SLEEP_REJECT_EN_S)
#define LP_PWR_LPCPU_SLEEP_REJECT_EN_V  0x00000001U
#define LP_PWR_LPCPU_SLEEP_REJECT_EN_S  31

/** LP_PWR_LPCPU_WAKEUP_CAUSE_REG register
 *  wakeup cause register for lpcpu
 */
#define LP_PWR_LPCPU_WAKEUP_CAUSE_REG (DR_REG_LP_PWR_BASE + 0x14)
/** LP_PWR_LPCPU_WAKEUP_CAUSE : RO; bitpos: [30:0]; default: 0;
 *  wakeup cause for lpcpu
 */
#define LP_PWR_LPCPU_WAKEUP_CAUSE    0x7FFFFFFFU
#define LP_PWR_LPCPU_WAKEUP_CAUSE_M  (LP_PWR_LPCPU_WAKEUP_CAUSE_V << LP_PWR_LPCPU_WAKEUP_CAUSE_S)
#define LP_PWR_LPCPU_WAKEUP_CAUSE_V  0x7FFFFFFFU
#define LP_PWR_LPCPU_WAKEUP_CAUSE_S  0

/** LP_PWR_LPCPU_REJECT_CAUSE_REG register
 *  reject cause register for lpcpu
 */
#define LP_PWR_LPCPU_REJECT_CAUSE_REG (DR_REG_LP_PWR_BASE + 0x18)
/** LP_PWR_LPCPU_REJECT_CAUSE : RO; bitpos: [30:0]; default: 0;
 *  reject cause for lpcpu
 */
#define LP_PWR_LPCPU_REJECT_CAUSE    0x7FFFFFFFU
#define LP_PWR_LPCPU_REJECT_CAUSE_M  (LP_PWR_LPCPU_REJECT_CAUSE_V << LP_PWR_LPCPU_REJECT_CAUSE_S)
#define LP_PWR_LPCPU_REJECT_CAUSE_V  0x7FFFFFFFU
#define LP_PWR_LPCPU_REJECT_CAUSE_S  0

/** LP_PWR_LPCPU_CAUSE_CLR_REG register
 *  cause clear register for lpcpu
 */
#define LP_PWR_LPCPU_CAUSE_CLR_REG (DR_REG_LP_PWR_BASE + 0x1c)
/** LP_PWR_LPCPU_REJECT_CAUSE_CLR : WT; bitpos: [0]; default: 0;
 *  reject cause clear signal for lpcpu
 */
#define LP_PWR_LPCPU_REJECT_CAUSE_CLR    (BIT(0))
#define LP_PWR_LPCPU_REJECT_CAUSE_CLR_M  (LP_PWR_LPCPU_REJECT_CAUSE_CLR_V << LP_PWR_LPCPU_REJECT_CAUSE_CLR_S)
#define LP_PWR_LPCPU_REJECT_CAUSE_CLR_V  0x00000001U
#define LP_PWR_LPCPU_REJECT_CAUSE_CLR_S  0
/** LP_PWR_LPCPU_WAKEUP_CAUSE_CLR : WT; bitpos: [1]; default: 0;
 *  wakeup cause clear signal for lpcpu
 */
#define LP_PWR_LPCPU_WAKEUP_CAUSE_CLR    (BIT(1))
#define LP_PWR_LPCPU_WAKEUP_CAUSE_CLR_M  (LP_PWR_LPCPU_WAKEUP_CAUSE_CLR_V << LP_PWR_LPCPU_WAKEUP_CAUSE_CLR_S)
#define LP_PWR_LPCPU_WAKEUP_CAUSE_CLR_V  0x00000001U
#define LP_PWR_LPCPU_WAKEUP_CAUSE_CLR_S  1

/** LP_PWR_APPWR_PWR_CFG_REG register
 *  config register for apsys pwr and clk mode
 */
#define LP_PWR_APPWR_PWR_CFG_REG (DR_REG_LP_PWR_BASE + 0x20)
/** LP_PWR_CPU_PWR_MODE : R/W; bitpos: [1:0]; default: 2;
 *  cpu pwr mode config register for apsys
 */
#define LP_PWR_CPU_PWR_MODE    0x00000003U
#define LP_PWR_CPU_PWR_MODE_M  (LP_PWR_CPU_PWR_MODE_V << LP_PWR_CPU_PWR_MODE_S)
#define LP_PWR_CPU_PWR_MODE_V  0x00000003U
#define LP_PWR_CPU_PWR_MODE_S  0
/** LP_PWR_TOP_PWR_MODE : R/W; bitpos: [3:2]; default: 2;
 *  top pwr mode config register for apsys
 */
#define LP_PWR_TOP_PWR_MODE    0x00000003U
#define LP_PWR_TOP_PWR_MODE_M  (LP_PWR_TOP_PWR_MODE_V << LP_PWR_TOP_PWR_MODE_S)
#define LP_PWR_TOP_PWR_MODE_V  0x00000003U
#define LP_PWR_TOP_PWR_MODE_S  2
/** LP_PWR_CNNT_PWR_MODE : R/W; bitpos: [5:4]; default: 2;
 *  cnnt pwr mode config register for apsys
 */
#define LP_PWR_CNNT_PWR_MODE    0x00000003U
#define LP_PWR_CNNT_PWR_MODE_M  (LP_PWR_CNNT_PWR_MODE_V << LP_PWR_CNNT_PWR_MODE_S)
#define LP_PWR_CNNT_PWR_MODE_V  0x00000003U
#define LP_PWR_CNNT_PWR_MODE_S  4
/** LP_PWR_HPALIVE_PWR_MODE : R/W; bitpos: [7:6]; default: 2;
 *  hpalive pwr mode config register for apsys
 */
#define LP_PWR_HPALIVE_PWR_MODE    0x00000003U
#define LP_PWR_HPALIVE_PWR_MODE_M  (LP_PWR_HPALIVE_PWR_MODE_V << LP_PWR_HPALIVE_PWR_MODE_S)
#define LP_PWR_HPALIVE_PWR_MODE_V  0x00000003U
#define LP_PWR_HPALIVE_PWR_MODE_S  6
/** LP_PWR_MEM_0_PWR_MODE : R/W; bitpos: [9:8]; default: 2;
 *  mem_0 pwr mode config register for apsys
 */
#define LP_PWR_MEM_0_PWR_MODE    0x00000003U
#define LP_PWR_MEM_0_PWR_MODE_M  (LP_PWR_MEM_0_PWR_MODE_V << LP_PWR_MEM_0_PWR_MODE_S)
#define LP_PWR_MEM_0_PWR_MODE_V  0x00000003U
#define LP_PWR_MEM_0_PWR_MODE_S  8
/** LP_PWR_MEM_1_PWR_MODE : R/W; bitpos: [11:10]; default: 2;
 *  mem_1 pwr mode config register for apsys
 */
#define LP_PWR_MEM_1_PWR_MODE    0x00000003U
#define LP_PWR_MEM_1_PWR_MODE_M  (LP_PWR_MEM_1_PWR_MODE_V << LP_PWR_MEM_1_PWR_MODE_S)
#define LP_PWR_MEM_1_PWR_MODE_V  0x00000003U
#define LP_PWR_MEM_1_PWR_MODE_S  10
/** LP_PWR_MEM_2_PWR_MODE : R/W; bitpos: [13:12]; default: 2;
 *  mem_2 pwr mode config register for apsys
 */
#define LP_PWR_MEM_2_PWR_MODE    0x00000003U
#define LP_PWR_MEM_2_PWR_MODE_M  (LP_PWR_MEM_2_PWR_MODE_V << LP_PWR_MEM_2_PWR_MODE_S)
#define LP_PWR_MEM_2_PWR_MODE_V  0x00000003U
#define LP_PWR_MEM_2_PWR_MODE_S  12
/** LP_PWR_MEM_3_PWR_MODE : R/W; bitpos: [15:14]; default: 2;
 *  mem_3 pwr mode config register for apsys
 */
#define LP_PWR_MEM_3_PWR_MODE    0x00000003U
#define LP_PWR_MEM_3_PWR_MODE_M  (LP_PWR_MEM_3_PWR_MODE_V << LP_PWR_MEM_3_PWR_MODE_S)
#define LP_PWR_MEM_3_PWR_MODE_V  0x00000003U
#define LP_PWR_MEM_3_PWR_MODE_S  14

/** LP_PWR_APPWR_CLK_CFG_REG register
 *  config register for apsys pwr and clk mode
 */
#define LP_PWR_APPWR_CLK_CFG_REG (DR_REG_LP_PWR_BASE + 0x24)
/** LP_PWR_CPU_CLK_MODE : R/W; bitpos: [1:0]; default: 3;
 *  cpu clk mode config register for apsys
 */
#define LP_PWR_CPU_CLK_MODE    0x00000003U
#define LP_PWR_CPU_CLK_MODE_M  (LP_PWR_CPU_CLK_MODE_V << LP_PWR_CPU_CLK_MODE_S)
#define LP_PWR_CPU_CLK_MODE_V  0x00000003U
#define LP_PWR_CPU_CLK_MODE_S  0
/** LP_PWR_TOP_CLK_MODE : R/W; bitpos: [3:2]; default: 3;
 *  top clk mode config register for apsys
 */
#define LP_PWR_TOP_CLK_MODE    0x00000003U
#define LP_PWR_TOP_CLK_MODE_M  (LP_PWR_TOP_CLK_MODE_V << LP_PWR_TOP_CLK_MODE_S)
#define LP_PWR_TOP_CLK_MODE_V  0x00000003U
#define LP_PWR_TOP_CLK_MODE_S  2
/** LP_PWR_CNNT_CLK_MODE : R/W; bitpos: [5:4]; default: 3;
 *  cnnt clk mode config register for apsys
 */
#define LP_PWR_CNNT_CLK_MODE    0x00000003U
#define LP_PWR_CNNT_CLK_MODE_M  (LP_PWR_CNNT_CLK_MODE_V << LP_PWR_CNNT_CLK_MODE_S)
#define LP_PWR_CNNT_CLK_MODE_V  0x00000003U
#define LP_PWR_CNNT_CLK_MODE_S  4
/** LP_PWR_HPALIVE_CLK_MODE : R/W; bitpos: [7:6]; default: 3;
 *  hpalive clk mode config register for apsys
 */
#define LP_PWR_HPALIVE_CLK_MODE    0x00000003U
#define LP_PWR_HPALIVE_CLK_MODE_M  (LP_PWR_HPALIVE_CLK_MODE_V << LP_PWR_HPALIVE_CLK_MODE_S)
#define LP_PWR_HPALIVE_CLK_MODE_V  0x00000003U
#define LP_PWR_HPALIVE_CLK_MODE_S  6
/** LP_PWR_MEM_0_CLK_MODE : R/W; bitpos: [9:8]; default: 3;
 *  mem_0 clk mode config register for apsys
 */
#define LP_PWR_MEM_0_CLK_MODE    0x00000003U
#define LP_PWR_MEM_0_CLK_MODE_M  (LP_PWR_MEM_0_CLK_MODE_V << LP_PWR_MEM_0_CLK_MODE_S)
#define LP_PWR_MEM_0_CLK_MODE_V  0x00000003U
#define LP_PWR_MEM_0_CLK_MODE_S  8
/** LP_PWR_MEM_1_CLK_MODE : R/W; bitpos: [11:10]; default: 3;
 *  mem_1 clk mode config register for apsys
 */
#define LP_PWR_MEM_1_CLK_MODE    0x00000003U
#define LP_PWR_MEM_1_CLK_MODE_M  (LP_PWR_MEM_1_CLK_MODE_V << LP_PWR_MEM_1_CLK_MODE_S)
#define LP_PWR_MEM_1_CLK_MODE_V  0x00000003U
#define LP_PWR_MEM_1_CLK_MODE_S  10
/** LP_PWR_MEM_2_CLK_MODE : R/W; bitpos: [13:12]; default: 3;
 *  mem_2 clk mode config register for apsys
 */
#define LP_PWR_MEM_2_CLK_MODE    0x00000003U
#define LP_PWR_MEM_2_CLK_MODE_M  (LP_PWR_MEM_2_CLK_MODE_V << LP_PWR_MEM_2_CLK_MODE_S)
#define LP_PWR_MEM_2_CLK_MODE_V  0x00000003U
#define LP_PWR_MEM_2_CLK_MODE_S  12
/** LP_PWR_MEM_3_CLK_MODE : R/W; bitpos: [15:14]; default: 3;
 *  mem_3 clk mode config register for apsys
 */
#define LP_PWR_MEM_3_CLK_MODE    0x00000003U
#define LP_PWR_MEM_3_CLK_MODE_M  (LP_PWR_MEM_3_CLK_MODE_V << LP_PWR_MEM_3_CLK_MODE_S)
#define LP_PWR_MEM_3_CLK_MODE_V  0x00000003U
#define LP_PWR_MEM_3_CLK_MODE_S  14

/** LP_PWR_APPWR_CFG_REG register
 *  config register for apsys pwr
 */
#define LP_PWR_APPWR_CFG_REG (DR_REG_LP_PWR_BASE + 0x28)
/** LP_PWR_STALL_WAIT_TIMER : R/W; bitpos: [7:0]; default: 0;
 *  the wait timer config for ap sys
 */
#define LP_PWR_STALL_WAIT_TIMER    0x000000FFU
#define LP_PWR_STALL_WAIT_TIMER_M  (LP_PWR_STALL_WAIT_TIMER_V << LP_PWR_STALL_WAIT_TIMER_S)
#define LP_PWR_STALL_WAIT_TIMER_V  0x000000FFU
#define LP_PWR_STALL_WAIT_TIMER_S  0
/** LP_PWR_BACKUP_EN : R/W; bitpos: [8]; default: 0;
 *  the backup enable config register for ap sys
 */
#define LP_PWR_BACKUP_EN    (BIT(8))
#define LP_PWR_BACKUP_EN_M  (LP_PWR_BACKUP_EN_V << LP_PWR_BACKUP_EN_S)
#define LP_PWR_BACKUP_EN_V  0x00000001U
#define LP_PWR_BACKUP_EN_S  8
/** LP_PWR_RESTORE_MODE : R/W; bitpos: [13:9]; default: 0;
 *  restore mode config register for apsys
 */
#define LP_PWR_RESTORE_MODE    0x0000001FU
#define LP_PWR_RESTORE_MODE_M  (LP_PWR_RESTORE_MODE_V << LP_PWR_RESTORE_MODE_S)
#define LP_PWR_RESTORE_MODE_V  0x0000001FU
#define LP_PWR_RESTORE_MODE_S  9
/** LP_PWR_BACKUP_MODE : R/W; bitpos: [18:14]; default: 0;
 *  backup mode config register for apsys
 */
#define LP_PWR_BACKUP_MODE    0x0000001FU
#define LP_PWR_BACKUP_MODE_M  (LP_PWR_BACKUP_MODE_V << LP_PWR_BACKUP_MODE_S)
#define LP_PWR_BACKUP_MODE_V  0x0000001FU
#define LP_PWR_BACKUP_MODE_S  14
/** LP_PWR_HPCPU_STALL_EN : R/W; bitpos: [19]; default: 1;
 *  1: enable hpcpu stall
 *  0: disable hpcpu stall
 */
#define LP_PWR_HPCPU_STALL_EN    (BIT(19))
#define LP_PWR_HPCPU_STALL_EN_M  (LP_PWR_HPCPU_STALL_EN_V << LP_PWR_HPCPU_STALL_EN_S)
#define LP_PWR_HPCPU_STALL_EN_V  0x00000001U
#define LP_PWR_HPCPU_STALL_EN_S  19

