espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_reg.h
/** LP_PWR_APPWR_STS_REG register
 *  status register for apsys pwr
 */
#define LP_PWR_APPWR_STS_REG (DR_REG_LP_PWR_BASE + 0x2c)
/** LP_PWR_APPWR_CUR_ST : RO; bitpos: [3:0]; default: 6;
 *  current power state register for apsys
 */
#define LP_PWR_APPWR_CUR_ST    0x0000000FU
#define LP_PWR_APPWR_CUR_ST_M  (LP_PWR_APPWR_CUR_ST_V << LP_PWR_APPWR_CUR_ST_S)
#define LP_PWR_APPWR_CUR_ST_V  0x0000000FU
#define LP_PWR_APPWR_CUR_ST_S  0
/** LP_PWR_APSYS_IN_POWER_ON : RO; bitpos: [4]; default: 0;
 *  1:apsys current in power on mode
 *  0:apsys not in power on mode
 */
#define LP_PWR_APSYS_IN_POWER_ON    (BIT(4))
#define LP_PWR_APSYS_IN_POWER_ON_M  (LP_PWR_APSYS_IN_POWER_ON_V << LP_PWR_APSYS_IN_POWER_ON_S)
#define LP_PWR_APSYS_IN_POWER_ON_V  0x00000001U
#define LP_PWR_APSYS_IN_POWER_ON_S  4

/** LP_PWR_APPWR_CTRL_REG register
 *  ctrl register for appwr power control
 */
#define LP_PWR_APPWR_CTRL_REG (DR_REG_LP_PWR_BASE + 0x30)
/** LP_PWR_APPWR_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for appwr
 */
#define LP_PWR_APPWR_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_APPWR_SW_SLEEP_REQ_M  (LP_PWR_APPWR_SW_SLEEP_REQ_V << LP_PWR_APPWR_SW_SLEEP_REQ_S)
#define LP_PWR_APPWR_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_APPWR_SW_SLEEP_REQ_S  0
/** LP_PWR_APPWR_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for appwr
 */
#define LP_PWR_APPWR_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_APPWR_SW_WAKEUP_REQ_M  (LP_PWR_APPWR_SW_WAKEUP_REQ_V << LP_PWR_APPWR_SW_WAKEUP_REQ_S)
#define LP_PWR_APPWR_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_APPWR_SW_WAKEUP_REQ_S  1
/** LP_PWR_HPCPU_FORCE_STALL : R/W; bitpos: [2]; default: 0;
 *  1: force stall hpcpu
 *  0: no change
 */
#define LP_PWR_HPCPU_FORCE_STALL    (BIT(2))
#define LP_PWR_HPCPU_FORCE_STALL_M  (LP_PWR_HPCPU_FORCE_STALL_V << LP_PWR_HPCPU_FORCE_STALL_S)
#define LP_PWR_HPCPU_FORCE_STALL_V  0x00000001U
#define LP_PWR_HPCPU_FORCE_STALL_S  2

/** LP_PWR_APPWR_WAKEUP_SRC_REG register
 *  wakeup source register for appwr
 */
#define LP_PWR_APPWR_WAKEUP_SRC_REG (DR_REG_LP_PWR_BASE + 0x34)
/** LP_PWR_APPWR_WAKEUP_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  wakeup enable signal for appwr
 */
#define LP_PWR_APPWR_WAKEUP_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_APPWR_WAKEUP_SOURCE_EN_M  (LP_PWR_APPWR_WAKEUP_SOURCE_EN_V << LP_PWR_APPWR_WAKEUP_SOURCE_EN_S)
#define LP_PWR_APPWR_WAKEUP_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_APPWR_WAKEUP_SOURCE_EN_S  0

/** LP_PWR_APPWR_REJECT_SRC_REG register
 *  reject source register for appwr
 */
#define LP_PWR_APPWR_REJECT_SRC_REG (DR_REG_LP_PWR_BASE + 0x38)
/** LP_PWR_APPWR_REJECT_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  reject enable signal for appwr
 */
#define LP_PWR_APPWR_REJECT_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_APPWR_REJECT_SOURCE_EN_M  (LP_PWR_APPWR_REJECT_SOURCE_EN_V << LP_PWR_APPWR_REJECT_SOURCE_EN_S)
#define LP_PWR_APPWR_REJECT_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_APPWR_REJECT_SOURCE_EN_S  0
/** LP_PWR_APPWR_SLEEP_REJECT_EN : R/W; bitpos: [31]; default: 0;
 *  1: sleep request can be rejected
 *  0: sleep request cannot be rejected
 */
#define LP_PWR_APPWR_SLEEP_REJECT_EN    (BIT(31))
#define LP_PWR_APPWR_SLEEP_REJECT_EN_M  (LP_PWR_APPWR_SLEEP_REJECT_EN_V << LP_PWR_APPWR_SLEEP_REJECT_EN_S)
#define LP_PWR_APPWR_SLEEP_REJECT_EN_V  0x00000001U
#define LP_PWR_APPWR_SLEEP_REJECT_EN_S  31

/** LP_PWR_APPWR_WAKEUP_CAUSE_REG register
 *  wakeup cause register for appwr
 */
#define LP_PWR_APPWR_WAKEUP_CAUSE_REG (DR_REG_LP_PWR_BASE + 0x3c)
/** LP_PWR_APPWR_WAKEUP_CAUSE : RO; bitpos: [30:0]; default: 0;
 *  wakeup cause for appwr
 */
#define LP_PWR_APPWR_WAKEUP_CAUSE    0x7FFFFFFFU
#define LP_PWR_APPWR_WAKEUP_CAUSE_M  (LP_PWR_APPWR_WAKEUP_CAUSE_V << LP_PWR_APPWR_WAKEUP_CAUSE_S)
#define LP_PWR_APPWR_WAKEUP_CAUSE_V  0x7FFFFFFFU
#define LP_PWR_APPWR_WAKEUP_CAUSE_S  0

/** LP_PWR_APPWR_REJECT_CAUSE_REG register
 *  reject cause register for appwr
 */
#define LP_PWR_APPWR_REJECT_CAUSE_REG (DR_REG_LP_PWR_BASE + 0x40)
/** LP_PWR_APPWR_REJECT_CAUSE : RO; bitpos: [30:0]; default: 0;
 *  reject cause for appwr
 */
#define LP_PWR_APPWR_REJECT_CAUSE    0x7FFFFFFFU
#define LP_PWR_APPWR_REJECT_CAUSE_M  (LP_PWR_APPWR_REJECT_CAUSE_V << LP_PWR_APPWR_REJECT_CAUSE_S)
#define LP_PWR_APPWR_REJECT_CAUSE_V  0x7FFFFFFFU
#define LP_PWR_APPWR_REJECT_CAUSE_S  0

/** LP_PWR_APPWR_CAUSE_CLR_REG register
 *  cause clear register for appwr
 */
#define LP_PWR_APPWR_CAUSE_CLR_REG (DR_REG_LP_PWR_BASE + 0x44)
/** LP_PWR_APPWR_REJECT_CAUSE_CLR : WT; bitpos: [0]; default: 0;
 *  reject cause clear signal for appwr
 */
#define LP_PWR_APPWR_REJECT_CAUSE_CLR    (BIT(0))
#define LP_PWR_APPWR_REJECT_CAUSE_CLR_M  (LP_PWR_APPWR_REJECT_CAUSE_CLR_V << LP_PWR_APPWR_REJECT_CAUSE_CLR_S)
#define LP_PWR_APPWR_REJECT_CAUSE_CLR_V  0x00000001U
#define LP_PWR_APPWR_REJECT_CAUSE_CLR_S  0
/** LP_PWR_APPWR_WAKEUP_CAUSE_CLR : WT; bitpos: [1]; default: 0;
 *  wakeup cause clear signal for appwr
 */
#define LP_PWR_APPWR_WAKEUP_CAUSE_CLR    (BIT(1))
#define LP_PWR_APPWR_WAKEUP_CAUSE_CLR_M  (LP_PWR_APPWR_WAKEUP_CAUSE_CLR_V << LP_PWR_APPWR_WAKEUP_CAUSE_CLR_S)
#define LP_PWR_APPWR_WAKEUP_CAUSE_CLR_V  0x00000001U
#define LP_PWR_APPWR_WAKEUP_CAUSE_CLR_S  1

/** LP_PWR_WIFI_CTRL_REG register
 *  ctrl register for wifi power control
 */
#define LP_PWR_WIFI_CTRL_REG (DR_REG_LP_PWR_BASE + 0x48)
/** LP_PWR_WIFI_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for wifi
 */
#define LP_PWR_WIFI_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_WIFI_SW_SLEEP_REQ_M  (LP_PWR_WIFI_SW_SLEEP_REQ_V << LP_PWR_WIFI_SW_SLEEP_REQ_S)
#define LP_PWR_WIFI_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_WIFI_SW_SLEEP_REQ_S  0
/** LP_PWR_WIFI_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for wifi
 */
#define LP_PWR_WIFI_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_WIFI_SW_WAKEUP_REQ_M  (LP_PWR_WIFI_SW_WAKEUP_REQ_V << LP_PWR_WIFI_SW_WAKEUP_REQ_S)
#define LP_PWR_WIFI_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_WIFI_SW_WAKEUP_REQ_S  1

