espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_reg.h
/** LP_PWR_WIFI_WAKEUP_SRC_REG register
 *  wakeup source register for wifi
 */
#define LP_PWR_WIFI_WAKEUP_SRC_REG (DR_REG_LP_PWR_BASE + 0x4c)
/** LP_PWR_WIFI_WAKEUP_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  wakeup enable signal for wifi
 */
#define LP_PWR_WIFI_WAKEUP_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_WIFI_WAKEUP_SOURCE_EN_M  (LP_PWR_WIFI_WAKEUP_SOURCE_EN_V << LP_PWR_WIFI_WAKEUP_SOURCE_EN_S)
#define LP_PWR_WIFI_WAKEUP_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_WIFI_WAKEUP_SOURCE_EN_S  0

/** LP_PWR_BLE_CTRL_REG register
 *  ctrl register for ble power control
 */
#define LP_PWR_BLE_CTRL_REG (DR_REG_LP_PWR_BASE + 0x50)
/** LP_PWR_BLE_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for ble
 */
#define LP_PWR_BLE_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_BLE_SW_SLEEP_REQ_M  (LP_PWR_BLE_SW_SLEEP_REQ_V << LP_PWR_BLE_SW_SLEEP_REQ_S)
#define LP_PWR_BLE_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_BLE_SW_SLEEP_REQ_S  0
/** LP_PWR_BLE_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for ble
 */
#define LP_PWR_BLE_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_BLE_SW_WAKEUP_REQ_M  (LP_PWR_BLE_SW_WAKEUP_REQ_V << LP_PWR_BLE_SW_WAKEUP_REQ_S)
#define LP_PWR_BLE_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_BLE_SW_WAKEUP_REQ_S  1

/** LP_PWR_BLE_WAKEUP_SRC_REG register
 *  wakeup source register for ble
 */
#define LP_PWR_BLE_WAKEUP_SRC_REG (DR_REG_LP_PWR_BASE + 0x54)
/** LP_PWR_BLE_WAKEUP_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  wakeup enable signal for ble
 */
#define LP_PWR_BLE_WAKEUP_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_BLE_WAKEUP_SOURCE_EN_M  (LP_PWR_BLE_WAKEUP_SOURCE_EN_V << LP_PWR_BLE_WAKEUP_SOURCE_EN_S)
#define LP_PWR_BLE_WAKEUP_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_BLE_WAKEUP_SOURCE_EN_S  0

/** LP_PWR_ZB_CTRL_REG register
 *  ctrl register for zb power control
 */
#define LP_PWR_ZB_CTRL_REG (DR_REG_LP_PWR_BASE + 0x58)
/** LP_PWR_ZB_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for zb
 */
#define LP_PWR_ZB_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_ZB_SW_SLEEP_REQ_M  (LP_PWR_ZB_SW_SLEEP_REQ_V << LP_PWR_ZB_SW_SLEEP_REQ_S)
#define LP_PWR_ZB_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_ZB_SW_SLEEP_REQ_S  0
/** LP_PWR_ZB_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for zb
 */
#define LP_PWR_ZB_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_ZB_SW_WAKEUP_REQ_M  (LP_PWR_ZB_SW_WAKEUP_REQ_V << LP_PWR_ZB_SW_WAKEUP_REQ_S)
#define LP_PWR_ZB_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_ZB_SW_WAKEUP_REQ_S  1

/** LP_PWR_ZB_WAKEUP_SRC_REG register
 *  wakeup source register for zb
 */
#define LP_PWR_ZB_WAKEUP_SRC_REG (DR_REG_LP_PWR_BASE + 0x5c)
/** LP_PWR_ZB_WAKEUP_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  wakeup enazb signal for zb
 */
#define LP_PWR_ZB_WAKEUP_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_ZB_WAKEUP_SOURCE_EN_M  (LP_PWR_ZB_WAKEUP_SOURCE_EN_V << LP_PWR_ZB_WAKEUP_SOURCE_EN_S)
#define LP_PWR_ZB_WAKEUP_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_ZB_WAKEUP_SOURCE_EN_S  0

/** LP_PWR_MODEMPWR_CTRL_REG register
 *  ctrl register for modempwr power control
 */
#define LP_PWR_MODEMPWR_CTRL_REG (DR_REG_LP_PWR_BASE + 0x60)
/** LP_PWR_MODEMPWR_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for modempwr
 */
#define LP_PWR_MODEMPWR_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_MODEMPWR_SW_SLEEP_REQ_M  (LP_PWR_MODEMPWR_SW_SLEEP_REQ_V << LP_PWR_MODEMPWR_SW_SLEEP_REQ_S)
#define LP_PWR_MODEMPWR_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_MODEMPWR_SW_SLEEP_REQ_S  0
/** LP_PWR_MODEMPWR_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for modempwr
 */
#define LP_PWR_MODEMPWR_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_MODEMPWR_SW_WAKEUP_REQ_M  (LP_PWR_MODEMPWR_SW_WAKEUP_REQ_V << LP_PWR_MODEMPWR_SW_WAKEUP_REQ_S)
#define LP_PWR_MODEMPWR_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_MODEMPWR_SW_WAKEUP_REQ_S  1

/** LP_PWR_MODEMPWR_WAKEUP_SRC_REG register
 *  wakeup source register for modempwr
 */
#define LP_PWR_MODEMPWR_WAKEUP_SRC_REG (DR_REG_LP_PWR_BASE + 0x64)
/** LP_PWR_MODEMPWR_WAKEUP_SOURCE_EN : R/W; bitpos: [30:0]; default: 0;
 *  wakeup enable signal for modempwr
 */
#define LP_PWR_MODEMPWR_WAKEUP_SOURCE_EN    0x7FFFFFFFU
#define LP_PWR_MODEMPWR_WAKEUP_SOURCE_EN_M  (LP_PWR_MODEMPWR_WAKEUP_SOURCE_EN_V << LP_PWR_MODEMPWR_WAKEUP_SOURCE_EN_S)
#define LP_PWR_MODEMPWR_WAKEUP_SOURCE_EN_V  0x7FFFFFFFU
#define LP_PWR_MODEMPWR_WAKEUP_SOURCE_EN_S  0

/** LP_PWR_PERI_PAD_WAKE_SLP_EN_REG register
 *  used for future potential eco, others don't care
 */
#define LP_PWR_PERI_PAD_WAKE_SLP_EN_REG (DR_REG_LP_PWR_BASE + 0x68)
/** LP_PWR_UART_WAKEUP_EN : R/W; bitpos: [0]; default: 0;
 *  1:enables uart wakeup after hpcpu stall
 *  0:disables uart wakeup after hpcpu stall
 */
#define LP_PWR_UART_WAKEUP_EN    (BIT(0))
#define LP_PWR_UART_WAKEUP_EN_M  (LP_PWR_UART_WAKEUP_EN_V << LP_PWR_UART_WAKEUP_EN_S)
#define LP_PWR_UART_WAKEUP_EN_V  0x00000001U
#define LP_PWR_UART_WAKEUP_EN_S  0
/** LP_PWR_HP_PAD_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  1:hppad will sleep after hpcpu stall
 *  0:hppad will not sleep after hpcpu stall
 */
#define LP_PWR_HP_PAD_SLP_SEL    (BIT(1))
#define LP_PWR_HP_PAD_SLP_SEL_M  (LP_PWR_HP_PAD_SLP_SEL_V << LP_PWR_HP_PAD_SLP_SEL_S)
#define LP_PWR_HP_PAD_SLP_SEL_V  0x00000001U
#define LP_PWR_HP_PAD_SLP_SEL_S  1
/** LP_PWR_LP_PAD_SLP_SEL : R/W; bitpos: [2]; default: 0;
 *  1:hppad will sleep after hpcpu stall
 *  0:hppad will not sleep after hpcpu stall
 */
#define LP_PWR_LP_PAD_SLP_SEL    (BIT(2))
#define LP_PWR_LP_PAD_SLP_SEL_M  (LP_PWR_LP_PAD_SLP_SEL_V << LP_PWR_LP_PAD_SLP_SEL_S)
#define LP_PWR_LP_PAD_SLP_SEL_V  0x00000001U
#define LP_PWR_LP_PAD_SLP_SEL_S  2

/** LP_PWR_TOUCH_CTRL_REG register
 *  ctrl register for touch power control
 */
#define LP_PWR_TOUCH_CTRL_REG (DR_REG_LP_PWR_BASE + 0x6c)
/** LP_PWR_TOUCH_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for touch
 */
#define LP_PWR_TOUCH_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_TOUCH_SW_SLEEP_REQ_M  (LP_PWR_TOUCH_SW_SLEEP_REQ_V << LP_PWR_TOUCH_SW_SLEEP_REQ_S)
#define LP_PWR_TOUCH_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_TOUCH_SW_SLEEP_REQ_S  0
/** LP_PWR_TOUCH_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for touch
 */
#define LP_PWR_TOUCH_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_TOUCH_SW_WAKEUP_REQ_M  (LP_PWR_TOUCH_SW_WAKEUP_REQ_V << LP_PWR_TOUCH_SW_WAKEUP_REQ_S)
#define LP_PWR_TOUCH_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_TOUCH_SW_WAKEUP_REQ_S  1

