espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_reg.h
/** LP_PWR_TOUCH_CFG_REG register
 *  ctrl register for touch power control
 */
#define LP_PWR_TOUCH_CFG_REG (DR_REG_LP_PWR_BASE + 0x70)
/** LP_PWR_TOUCH_SLEEP_CYCLES : R/W; bitpos: [25:0]; default: 100;
 *  sleep cycles config for touch
 */
#define LP_PWR_TOUCH_SLEEP_CYCLES    0x03FFFFFFU
#define LP_PWR_TOUCH_SLEEP_CYCLES_M  (LP_PWR_TOUCH_SLEEP_CYCLES_V << LP_PWR_TOUCH_SLEEP_CYCLES_S)
#define LP_PWR_TOUCH_SLEEP_CYCLES_V  0x03FFFFFFU
#define LP_PWR_TOUCH_SLEEP_CYCLES_S  0
/** LP_PWR_TOUCH_SLEEP_TIMER_EN : R/W; bitpos: [26]; default: 0;
 *  1:enables touch timer wakeup source
 *  0:disables touch timer wakeup source
 */
#define LP_PWR_TOUCH_SLEEP_TIMER_EN    (BIT(26))
#define LP_PWR_TOUCH_SLEEP_TIMER_EN_M  (LP_PWR_TOUCH_SLEEP_TIMER_EN_V << LP_PWR_TOUCH_SLEEP_TIMER_EN_S)
#define LP_PWR_TOUCH_SLEEP_TIMER_EN_V  0x00000001U
#define LP_PWR_TOUCH_SLEEP_TIMER_EN_S  26
/** LP_PWR_TOUCH_FORCE_DONE : R/W; bitpos: [27]; default: 0;
 *  1: force touch task to done state, turn off touch
 *  0: no effect
 */
#define LP_PWR_TOUCH_FORCE_DONE    (BIT(27))
#define LP_PWR_TOUCH_FORCE_DONE_M  (LP_PWR_TOUCH_FORCE_DONE_V << LP_PWR_TOUCH_FORCE_DONE_S)
#define LP_PWR_TOUCH_FORCE_DONE_V  0x00000001U
#define LP_PWR_TOUCH_FORCE_DONE_S  27

/** LP_PWR_TOUCH_STS_REG register
 *  status register for TOUCH PWR
 */
#define LP_PWR_TOUCH_STS_REG (DR_REG_LP_PWR_BASE + 0x74)
/** LP_PWR_TOUCH_CUR_ST : RO; bitpos: [2:0]; default: 4;
 *  current power state register for touch
 */
#define LP_PWR_TOUCH_CUR_ST    0x00000007U
#define LP_PWR_TOUCH_CUR_ST_M  (LP_PWR_TOUCH_CUR_ST_V << LP_PWR_TOUCH_CUR_ST_S)
#define LP_PWR_TOUCH_CUR_ST_V  0x00000007U
#define LP_PWR_TOUCH_CUR_ST_S  0
/** LP_PWR_TOUCH_IN_POWER_ON : RO; bitpos: [3]; default: 0;
 *  1:touch current in power on mode
 *  0:touch not in power on mode
 */
#define LP_PWR_TOUCH_IN_POWER_ON    (BIT(3))
#define LP_PWR_TOUCH_IN_POWER_ON_M  (LP_PWR_TOUCH_IN_POWER_ON_V << LP_PWR_TOUCH_IN_POWER_ON_S)
#define LP_PWR_TOUCH_IN_POWER_ON_V  0x00000001U
#define LP_PWR_TOUCH_IN_POWER_ON_S  3

/** LP_PWR_CALI_CTRL_REG register
 *  ctrl register for cali power control
 */
#define LP_PWR_CALI_CTRL_REG (DR_REG_LP_PWR_BASE + 0x78)
/** LP_PWR_CALI_SW_SLEEP_REQ : WT; bitpos: [0]; default: 0;
 *  software sleep request config for cali
 */
#define LP_PWR_CALI_SW_SLEEP_REQ    (BIT(0))
#define LP_PWR_CALI_SW_SLEEP_REQ_M  (LP_PWR_CALI_SW_SLEEP_REQ_V << LP_PWR_CALI_SW_SLEEP_REQ_S)
#define LP_PWR_CALI_SW_SLEEP_REQ_V  0x00000001U
#define LP_PWR_CALI_SW_SLEEP_REQ_S  0
/** LP_PWR_CALI_SW_WAKEUP_REQ : WT; bitpos: [1]; default: 0;
 *  software wakeup request config for cali
 */
#define LP_PWR_CALI_SW_WAKEUP_REQ    (BIT(1))
#define LP_PWR_CALI_SW_WAKEUP_REQ_M  (LP_PWR_CALI_SW_WAKEUP_REQ_V << LP_PWR_CALI_SW_WAKEUP_REQ_S)
#define LP_PWR_CALI_SW_WAKEUP_REQ_V  0x00000001U
#define LP_PWR_CALI_SW_WAKEUP_REQ_S  1

/** LP_PWR_CALI_STS_REG register
 *  status register for CALI PWR
 */
#define LP_PWR_CALI_STS_REG (DR_REG_LP_PWR_BASE + 0x7c)
/** LP_PWR_CALI_CUR_ST : RO; bitpos: [2:0]; default: 4;
 *  current power state register for cali
 */
#define LP_PWR_CALI_CUR_ST    0x00000007U
#define LP_PWR_CALI_CUR_ST_M  (LP_PWR_CALI_CUR_ST_V << LP_PWR_CALI_CUR_ST_S)
#define LP_PWR_CALI_CUR_ST_V  0x00000007U
#define LP_PWR_CALI_CUR_ST_S  0
/** LP_PWR_CALI_IN_POWER_ON : RO; bitpos: [3]; default: 0;
 *  1:cali current in power on mode
 *  0:cali not in power on mode
 */
#define LP_PWR_CALI_IN_POWER_ON    (BIT(3))
#define LP_PWR_CALI_IN_POWER_ON_M  (LP_PWR_CALI_IN_POWER_ON_V << LP_PWR_CALI_IN_POWER_ON_S)
#define LP_PWR_CALI_IN_POWER_ON_V  0x00000001U
#define LP_PWR_CALI_IN_POWER_ON_S  3

/** LP_PWR_LPPERI_PWR_CLK_CFG_REG register
 *  ctrl register for lpcpu power clock mode control
 */
#define LP_PWR_LPPERI_PWR_CLK_CFG_REG (DR_REG_LP_PWR_BASE + 0x80)
/** LP_PWR_LPPERI_SW_CLK_MODE : R/W; bitpos: [1:0]; default: 3;
 *  software configs LPPERI clk mode
 */
#define LP_PWR_LPPERI_SW_CLK_MODE    0x00000003U
#define LP_PWR_LPPERI_SW_CLK_MODE_M  (LP_PWR_LPPERI_SW_CLK_MODE_V << LP_PWR_LPPERI_SW_CLK_MODE_S)
#define LP_PWR_LPPERI_SW_CLK_MODE_V  0x00000003U
#define LP_PWR_LPPERI_SW_CLK_MODE_S  0
/** LP_PWR_LPPERI_SW_PWR_MODE : R/W; bitpos: [3:2]; default: 2;
 *  software configs LPPERI pwr mode
 */
#define LP_PWR_LPPERI_SW_PWR_MODE    0x00000003U
#define LP_PWR_LPPERI_SW_PWR_MODE_M  (LP_PWR_LPPERI_SW_PWR_MODE_V << LP_PWR_LPPERI_SW_PWR_MODE_S)
#define LP_PWR_LPPERI_SW_PWR_MODE_V  0x00000003U
#define LP_PWR_LPPERI_SW_PWR_MODE_S  2

/** LP_PWR_LPPERI_CTRL_REG register
 *  ctrl register for lpperi power control
 */
#define LP_PWR_LPPERI_CTRL_REG (DR_REG_LP_PWR_BASE + 0x84)
/** LP_PWR_LPPERI_SW_FORCE_ON : R/W; bitpos: [0]; default: 1;
 *  1: software wake lpperi
 */
#define LP_PWR_LPPERI_SW_FORCE_ON    (BIT(0))
#define LP_PWR_LPPERI_SW_FORCE_ON_M  (LP_PWR_LPPERI_SW_FORCE_ON_V << LP_PWR_LPPERI_SW_FORCE_ON_S)
#define LP_PWR_LPPERI_SW_FORCE_ON_V  0x00000001U
#define LP_PWR_LPPERI_SW_FORCE_ON_S  0
/** LP_PWR_LPPERI_SW_REQ : WT; bitpos: [1]; default: 0;
 *  software req  pulse for following mode register
 */
#define LP_PWR_LPPERI_SW_REQ    (BIT(1))
#define LP_PWR_LPPERI_SW_REQ_M  (LP_PWR_LPPERI_SW_REQ_V << LP_PWR_LPPERI_SW_REQ_S)
#define LP_PWR_LPPERI_SW_REQ_V  0x00000001U
#define LP_PWR_LPPERI_SW_REQ_S  1

/** LP_PWR_LP_PAD_CFG_REG register
 *  config register for lppad hold signal
 */
#define LP_PWR_LP_PAD_CFG_REG (DR_REG_LP_PWR_BASE + 0x88)
/** LP_PWR_LPPAD_HOLD_CPU_PAUSE_EN : R/W; bitpos: [0]; default: 0;
 *  1: hold lppad when hpcpu stalls
 *  0: not hold lppad when hpcpu stalls
 */
#define LP_PWR_LPPAD_HOLD_CPU_PAUSE_EN    (BIT(0))
#define LP_PWR_LPPAD_HOLD_CPU_PAUSE_EN_M  (LP_PWR_LPPAD_HOLD_CPU_PAUSE_EN_V << LP_PWR_LPPAD_HOLD_CPU_PAUSE_EN_S)
#define LP_PWR_LPPAD_HOLD_CPU_PAUSE_EN_V  0x00000001U
#define LP_PWR_LPPAD_HOLD_CPU_PAUSE_EN_S  0
/** LP_PWR_FORCE_HIGH_LP_PAD_HOLD : R/W; bitpos: [1]; default: 0;
 *  1:force pull up lppad hold signal
 *  0:no effect
 */
#define LP_PWR_FORCE_HIGH_LP_PAD_HOLD    (BIT(1))
#define LP_PWR_FORCE_HIGH_LP_PAD_HOLD_M  (LP_PWR_FORCE_HIGH_LP_PAD_HOLD_V << LP_PWR_FORCE_HIGH_LP_PAD_HOLD_S)
#define LP_PWR_FORCE_HIGH_LP_PAD_HOLD_V  0x00000001U
#define LP_PWR_FORCE_HIGH_LP_PAD_HOLD_S  1
/** LP_PWR_FORCE_LOW_LP_PAD_HOLD : R/W; bitpos: [2]; default: 0;
 *  1:force pull low lppad hold signal
 *  0:no effect
 */
#define LP_PWR_FORCE_LOW_LP_PAD_HOLD    (BIT(2))
#define LP_PWR_FORCE_LOW_LP_PAD_HOLD_M  (LP_PWR_FORCE_LOW_LP_PAD_HOLD_V << LP_PWR_FORCE_LOW_LP_PAD_HOLD_S)
#define LP_PWR_FORCE_LOW_LP_PAD_HOLD_V  0x00000001U
#define LP_PWR_FORCE_LOW_LP_PAD_HOLD_S  2

/** LP_PWR_CNNT_PAD_CFG_REG register
 *  config register for cnntpad hold signal
 */
#define LP_PWR_CNNT_PAD_CFG_REG (DR_REG_LP_PWR_BASE + 0x8c)
/** LP_PWR_CNNT_PAD_HOLD_CPU_PAUSE_EN : R/W; bitpos: [0]; default: 0;
 *  1: hold cnntpad when hpcpu stalls
 *  0: not hold cnntpad when hpcpu stalls
 */
#define LP_PWR_CNNT_PAD_HOLD_CPU_PAUSE_EN    (BIT(0))
#define LP_PWR_CNNT_PAD_HOLD_CPU_PAUSE_EN_M  (LP_PWR_CNNT_PAD_HOLD_CPU_PAUSE_EN_V << LP_PWR_CNNT_PAD_HOLD_CPU_PAUSE_EN_S)
#define LP_PWR_CNNT_PAD_HOLD_CPU_PAUSE_EN_V  0x00000001U
#define LP_PWR_CNNT_PAD_HOLD_CPU_PAUSE_EN_S  0
/** LP_PWR_FORCE_HIGH_CNNT_PAD_HOLD : R/W; bitpos: [1]; default: 0;
 *  1:force pull up cnntpad hold signal
 *  0:no effect
 */
#define LP_PWR_FORCE_HIGH_CNNT_PAD_HOLD    (BIT(1))
#define LP_PWR_FORCE_HIGH_CNNT_PAD_HOLD_M  (LP_PWR_FORCE_HIGH_CNNT_PAD_HOLD_V << LP_PWR_FORCE_HIGH_CNNT_PAD_HOLD_S)
#define LP_PWR_FORCE_HIGH_CNNT_PAD_HOLD_V  0x00000001U
#define LP_PWR_FORCE_HIGH_CNNT_PAD_HOLD_S  1
/** LP_PWR_FORCE_LOW_CNNT_PAD_HOLD : R/W; bitpos: [2]; default: 0;
 *  1:force pull low cnntpad hold signal
 *  0:no effect
 */
#define LP_PWR_FORCE_LOW_CNNT_PAD_HOLD    (BIT(2))
#define LP_PWR_FORCE_LOW_CNNT_PAD_HOLD_M  (LP_PWR_FORCE_LOW_CNNT_PAD_HOLD_V << LP_PWR_FORCE_LOW_CNNT_PAD_HOLD_S)
#define LP_PWR_FORCE_LOW_CNNT_PAD_HOLD_V  0x00000001U
#define LP_PWR_FORCE_LOW_CNNT_PAD_HOLD_S  2

/** LP_PWR_HP_PAD_CFG_REG register
 *  config register for hppad hold signal
 */
#define LP_PWR_HP_PAD_CFG_REG (DR_REG_LP_PWR_BASE + 0x90)
/** LP_PWR_HPPAD_HOLD_CPU_PAUSE_EN : R/W; bitpos: [0]; default: 0;
 *  1: hold hppad when hpcpu stalls
 *  0: not hold hppad when hpcpu stalls
 */
#define LP_PWR_HPPAD_HOLD_CPU_PAUSE_EN    (BIT(0))
#define LP_PWR_HPPAD_HOLD_CPU_PAUSE_EN_M  (LP_PWR_HPPAD_HOLD_CPU_PAUSE_EN_V << LP_PWR_HPPAD_HOLD_CPU_PAUSE_EN_S)
#define LP_PWR_HPPAD_HOLD_CPU_PAUSE_EN_V  0x00000001U
#define LP_PWR_HPPAD_HOLD_CPU_PAUSE_EN_S  0
/** LP_PWR_FORCE_HIGH_HP_PAD_HOLD : R/W; bitpos: [1]; default: 0;
 *  1:force pull up hppad hold signal
 *  0:no effect
 */
#define LP_PWR_FORCE_HIGH_HP_PAD_HOLD    (BIT(1))
#define LP_PWR_FORCE_HIGH_HP_PAD_HOLD_M  (LP_PWR_FORCE_HIGH_HP_PAD_HOLD_V << LP_PWR_FORCE_HIGH_HP_PAD_HOLD_S)
#define LP_PWR_FORCE_HIGH_HP_PAD_HOLD_V  0x00000001U
#define LP_PWR_FORCE_HIGH_HP_PAD_HOLD_S  1
/** LP_PWR_FORCE_LOW_HP_PAD_HOLD : R/W; bitpos: [2]; default: 0;
 *  1:force pull low hppad hold signal
 *  0:no effect
 */
#define LP_PWR_FORCE_LOW_HP_PAD_HOLD    (BIT(2))
#define LP_PWR_FORCE_LOW_HP_PAD_HOLD_M  (LP_PWR_FORCE_LOW_HP_PAD_HOLD_V << LP_PWR_FORCE_LOW_HP_PAD_HOLD_S)
#define LP_PWR_FORCE_LOW_HP_PAD_HOLD_V  0x00000001U
#define LP_PWR_FORCE_LOW_HP_PAD_HOLD_S  2

