espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_reg.h
/** LP_PWR_INT_RAW_REG register
 *  need_des
 */
#define LP_PWR_INT_RAW_REG (DR_REG_LP_PWR_BASE + 0x94)
/** LP_PWR_ZB_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  need_des
 */
#define LP_PWR_ZB_WAKE_PROCESS_INT_RAW    (BIT(24))
#define LP_PWR_ZB_WAKE_PROCESS_INT_RAW_M  (LP_PWR_ZB_WAKE_PROCESS_INT_RAW_V << LP_PWR_ZB_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_ZB_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_ZB_WAKE_PROCESS_INT_RAW_S  24
/** LP_PWR_MODEMPWR_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  need_des
 */
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_RAW    (BIT(25))
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_RAW_M  (LP_PWR_MODEMPWR_WAKE_PROCESS_INT_RAW_V << LP_PWR_MODEMPWR_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_RAW_S  25
/** LP_PWR_BLE_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_PWR_BLE_WAKE_PROCESS_INT_RAW    (BIT(26))
#define LP_PWR_BLE_WAKE_PROCESS_INT_RAW_M  (LP_PWR_BLE_WAKE_PROCESS_INT_RAW_V << LP_PWR_BLE_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_BLE_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_BLE_WAKE_PROCESS_INT_RAW_S  26
/** LP_PWR_WIFI_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_PWR_WIFI_WAKE_PROCESS_INT_RAW    (BIT(27))
#define LP_PWR_WIFI_WAKE_PROCESS_INT_RAW_M  (LP_PWR_WIFI_WAKE_PROCESS_INT_RAW_V << LP_PWR_WIFI_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_WIFI_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_WIFI_WAKE_PROCESS_INT_RAW_S  27
/** LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_RAW    (BIT(28))
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_RAW_M  (LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_RAW_V << LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_RAW_S  28
/** LP_PWR_TOUCH_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_RAW    (BIT(29))
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_RAW_M  (LP_PWR_TOUCH_WAKE_PROCESS_INT_RAW_V << LP_PWR_TOUCH_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_RAW_S  29
/** LP_PWR_LPCPU_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_RAW    (BIT(30))
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_RAW_M  (LP_PWR_LPCPU_WAKE_PROCESS_INT_RAW_V << LP_PWR_LPCPU_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_RAW_S  30
/** LP_PWR_APPWR_WAKE_PROCESS_INT_RAW : R/WTC/SS; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_PWR_APPWR_WAKE_PROCESS_INT_RAW    (BIT(31))
#define LP_PWR_APPWR_WAKE_PROCESS_INT_RAW_M  (LP_PWR_APPWR_WAKE_PROCESS_INT_RAW_V << LP_PWR_APPWR_WAKE_PROCESS_INT_RAW_S)
#define LP_PWR_APPWR_WAKE_PROCESS_INT_RAW_V  0x00000001U
#define LP_PWR_APPWR_WAKE_PROCESS_INT_RAW_S  31

/** LP_PWR_INT_ST_REG register
 *  need_des
 */
#define LP_PWR_INT_ST_REG (DR_REG_LP_PWR_BASE + 0x98)
/** LP_PWR_ZB_WAKE_PROCESS_INT_ST : RO; bitpos: [24]; default: 0;
 *  need_des
 */
#define LP_PWR_ZB_WAKE_PROCESS_INT_ST    (BIT(24))
#define LP_PWR_ZB_WAKE_PROCESS_INT_ST_M  (LP_PWR_ZB_WAKE_PROCESS_INT_ST_V << LP_PWR_ZB_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_ZB_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_ZB_WAKE_PROCESS_INT_ST_S  24
/** LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ST : RO; bitpos: [25]; default: 0;
 *  need_des
 */
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ST    (BIT(25))
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ST_M  (LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ST_V << LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ST_S  25
/** LP_PWR_BLE_WAKE_PROCESS_INT_ST : RO; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_PWR_BLE_WAKE_PROCESS_INT_ST    (BIT(26))
#define LP_PWR_BLE_WAKE_PROCESS_INT_ST_M  (LP_PWR_BLE_WAKE_PROCESS_INT_ST_V << LP_PWR_BLE_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_BLE_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_BLE_WAKE_PROCESS_INT_ST_S  26
/** LP_PWR_WIFI_WAKE_PROCESS_INT_ST : RO; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ST    (BIT(27))
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ST_M  (LP_PWR_WIFI_WAKE_PROCESS_INT_ST_V << LP_PWR_WIFI_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ST_S  27
/** LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ST : RO; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ST    (BIT(28))
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ST_M  (LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ST_V << LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ST_S  28
/** LP_PWR_TOUCH_WAKE_PROCESS_INT_ST : RO; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ST    (BIT(29))
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ST_M  (LP_PWR_TOUCH_WAKE_PROCESS_INT_ST_V << LP_PWR_TOUCH_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ST_S  29
/** LP_PWR_LPCPU_WAKE_PROCESS_INT_ST : RO; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ST    (BIT(30))
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ST_M  (LP_PWR_LPCPU_WAKE_PROCESS_INT_ST_V << LP_PWR_LPCPU_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ST_S  30
/** LP_PWR_APPWR_WAKE_PROCESS_INT_ST : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ST    (BIT(31))
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ST_M  (LP_PWR_APPWR_WAKE_PROCESS_INT_ST_V << LP_PWR_APPWR_WAKE_PROCESS_INT_ST_S)
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ST_V  0x00000001U
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ST_S  31

