espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_reg.h
/** LP_PWR_INT_ENA_REG register
 *  need_des
 */
#define LP_PWR_INT_ENA_REG (DR_REG_LP_PWR_BASE + 0x9c)
/** LP_PWR_ZB_WAKE_PROCESS_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define LP_PWR_ZB_WAKE_PROCESS_INT_ENA    (BIT(24))
#define LP_PWR_ZB_WAKE_PROCESS_INT_ENA_M  (LP_PWR_ZB_WAKE_PROCESS_INT_ENA_V << LP_PWR_ZB_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_ZB_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_ZB_WAKE_PROCESS_INT_ENA_S  24
/** LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ENA    (BIT(25))
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ENA_M  (LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ENA_V << LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_ENA_S  25
/** LP_PWR_BLE_WAKE_PROCESS_INT_ENA : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_PWR_BLE_WAKE_PROCESS_INT_ENA    (BIT(26))
#define LP_PWR_BLE_WAKE_PROCESS_INT_ENA_M  (LP_PWR_BLE_WAKE_PROCESS_INT_ENA_V << LP_PWR_BLE_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_BLE_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_BLE_WAKE_PROCESS_INT_ENA_S  26
/** LP_PWR_WIFI_WAKE_PROCESS_INT_ENA : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ENA    (BIT(27))
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ENA_M  (LP_PWR_WIFI_WAKE_PROCESS_INT_ENA_V << LP_PWR_WIFI_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_WIFI_WAKE_PROCESS_INT_ENA_S  27
/** LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ENA : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ENA    (BIT(28))
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ENA_M  (LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ENA_V << LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_ENA_S  28
/** LP_PWR_TOUCH_WAKE_PROCESS_INT_ENA : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ENA    (BIT(29))
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ENA_M  (LP_PWR_TOUCH_WAKE_PROCESS_INT_ENA_V << LP_PWR_TOUCH_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_ENA_S  29
/** LP_PWR_LPCPU_WAKE_PROCESS_INT_ENA : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ENA    (BIT(30))
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ENA_M  (LP_PWR_LPCPU_WAKE_PROCESS_INT_ENA_V << LP_PWR_LPCPU_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_ENA_S  30
/** LP_PWR_APPWR_WAKE_PROCESS_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ENA    (BIT(31))
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ENA_M  (LP_PWR_APPWR_WAKE_PROCESS_INT_ENA_V << LP_PWR_APPWR_WAKE_PROCESS_INT_ENA_S)
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ENA_V  0x00000001U
#define LP_PWR_APPWR_WAKE_PROCESS_INT_ENA_S  31

/** LP_PWR_INT_CLR_REG register
 *  need_des
 */
#define LP_PWR_INT_CLR_REG (DR_REG_LP_PWR_BASE + 0xa0)
/** LP_PWR_ZB_WAKE_PROCESS_INT_CLR : WT; bitpos: [24]; default: 0;
 *  need_des
 */
#define LP_PWR_ZB_WAKE_PROCESS_INT_CLR    (BIT(24))
#define LP_PWR_ZB_WAKE_PROCESS_INT_CLR_M  (LP_PWR_ZB_WAKE_PROCESS_INT_CLR_V << LP_PWR_ZB_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_ZB_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_ZB_WAKE_PROCESS_INT_CLR_S  24
/** LP_PWR_MODEMPWR_WAKE_PROCESS_INT_CLR : WT; bitpos: [25]; default: 0;
 *  need_des
 */
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_CLR    (BIT(25))
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_CLR_M  (LP_PWR_MODEMPWR_WAKE_PROCESS_INT_CLR_V << LP_PWR_MODEMPWR_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_MODEMPWR_WAKE_PROCESS_INT_CLR_S  25
/** LP_PWR_BLE_WAKE_PROCESS_INT_CLR : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_PWR_BLE_WAKE_PROCESS_INT_CLR    (BIT(26))
#define LP_PWR_BLE_WAKE_PROCESS_INT_CLR_M  (LP_PWR_BLE_WAKE_PROCESS_INT_CLR_V << LP_PWR_BLE_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_BLE_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_BLE_WAKE_PROCESS_INT_CLR_S  26
/** LP_PWR_WIFI_WAKE_PROCESS_INT_CLR : WT; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_PWR_WIFI_WAKE_PROCESS_INT_CLR    (BIT(27))
#define LP_PWR_WIFI_WAKE_PROCESS_INT_CLR_M  (LP_PWR_WIFI_WAKE_PROCESS_INT_CLR_V << LP_PWR_WIFI_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_WIFI_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_WIFI_WAKE_PROCESS_INT_CLR_S  27
/** LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_CLR : WT; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_CLR    (BIT(28))
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_CLR_M  (LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_CLR_V << LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_XTAL_CALI_WAKE_PROCESS_INT_CLR_S  28
/** LP_PWR_TOUCH_WAKE_PROCESS_INT_CLR : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_CLR    (BIT(29))
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_CLR_M  (LP_PWR_TOUCH_WAKE_PROCESS_INT_CLR_V << LP_PWR_TOUCH_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_TOUCH_WAKE_PROCESS_INT_CLR_S  29
/** LP_PWR_LPCPU_WAKE_PROCESS_INT_CLR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_CLR    (BIT(30))
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_CLR_M  (LP_PWR_LPCPU_WAKE_PROCESS_INT_CLR_V << LP_PWR_LPCPU_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_LPCPU_WAKE_PROCESS_INT_CLR_S  30
/** LP_PWR_APPWR_WAKE_PROCESS_INT_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_PWR_APPWR_WAKE_PROCESS_INT_CLR    (BIT(31))
#define LP_PWR_APPWR_WAKE_PROCESS_INT_CLR_M  (LP_PWR_APPWR_WAKE_PROCESS_INT_CLR_V << LP_PWR_APPWR_WAKE_PROCESS_INT_CLR_S)
#define LP_PWR_APPWR_WAKE_PROCESS_INT_CLR_V  0x00000001U
#define LP_PWR_APPWR_WAKE_PROCESS_INT_CLR_S  31

/** LP_PWR_VER_DATE_REG register
 *  need_des
 */
#define LP_PWR_VER_DATE_REG (DR_REG_LP_PWR_BASE + 0xa4)
/** LP_PWR_VER_DATE : R/W; bitpos: [30:0]; default: 2426648;
 *  need_des
 */
#define LP_PWR_VER_DATE    0x7FFFFFFFU
#define LP_PWR_VER_DATE_M  (LP_PWR_VER_DATE_V << LP_PWR_VER_DATE_S)
#define LP_PWR_VER_DATE_V  0x7FFFFFFFU
#define LP_PWR_VER_DATE_S  0
/** LP_PWR_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_PWR_CLK_EN    (BIT(31))
#define LP_PWR_CLK_EN_M  (LP_PWR_CLK_EN_V << LP_PWR_CLK_EN_S)
#define LP_PWR_CLK_EN_V  0x00000001U
#define LP_PWR_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
